In [59]:
#Readng existing excel file
import pandas as pd
df=pd.read_excel("marksheet1.xlsx")
print(df)

   Roll no.           Name  LICA   DLC  EM 2   T&D
0         1       Abhinith  36.0  41.0  63.0   NaN
1         2         Akilan  23.0   NaN  56.0  65.0
2         3      Anulaxxmi  23.0   NaN  53.0  33.0
3         4  Aravind Kumar   NaN  65.0   NaN  32.0
4         5          Arjun  34.0  65.0  76.0   NaN
5         6         Ashwin  25.0   NaN  23.0  54.0
6         7           Arya   NaN  57.0  75.0  23.0
7         8           Babu  75.0  54.0   NaN  43.0
8         9  Balaganapathy  43.0   NaN  65.0  43.0
9        10    Balamurugan  54.0  64.0   NaN  75.0

In [76]:
#displaying specific number of columns
pd.set_option('display.max_column',2)
a=pd.read_excel("marksheet1.xlsx")
print(a)
a.to_excel("marksheet.xlsx")

   Roll no.  ...   T&D
0         1  ...   NaN
1         2  ...  65.0
2         3  ...  33.0
3         4  ...  32.0
4         5  ...   NaN
5         6  ...  54.0
6         7  ...  23.0
7         8  ...  43.0
8         9  ...  43.0
9        10  ...  75.0

[10 rows x 6 columns]

In [60]:
#Replacing NaN values with previous values
b=pd.read_excel("marksheet1.xlsx")
k=b.fillna(method='pad')
print(k)
print("\n Updated line")
k.to_excel("marksheet.xlsx")

   Roll no.           Name  LICA   DLC  EM 2   T&D
0         1       Abhinith  36.0  41.0  63.0   NaN
1         2         Akilan  23.0  41.0  56.0  65.0
2         3      Anulaxxmi  23.0  41.0  53.0  33.0
3         4  Aravind Kumar  23.0  65.0  53.0  32.0
4         5          Arjun  34.0  65.0  76.0  32.0
5         6         Ashwin  25.0  65.0  23.0  54.0
6         7           Arya  25.0  57.0  75.0  23.0
7         8           Babu  75.0  54.0  75.0  43.0
8         9  Balaganapathy  43.0  54.0  65.0  43.0
9        10    Balamurugan  54.0  64.0  65.0  75.0

 Updated line

In [62]:
df.drop(['DLC'],axis=1,inplace=True)
print(df)
k.to_excel("marksheet.xlsx")

   Roll no.           Name  LICA  EM 2   T&D
0         1       Abhinith  36.0  63.0   NaN
1         2         Akilan  23.0  56.0  65.0
2         3      Anulaxxmi  23.0  53.0  33.0
3         4  Aravind Kumar   NaN   NaN  32.0
4         5          Arjun  34.0  76.0   NaN
5         6         Ashwin  25.0  23.0  54.0
6         7           Arya   NaN  75.0  23.0
7         8           Babu  75.0   NaN  43.0
8         9  Balaganapathy  43.0  65.0  43.0
9        10    Balamurugan  54.0   NaN  75.0

In [64]:
print("\nDrop NaN row:\n\n")
df=pd.read_excel("marksheet1.xlsx")
print(df)
x=df.dropna()
print(x)

Drop NaN row:


   Roll no.           Name  LICA   DLC  EM 2   T&D
0         1       Abhinith  36.0  41.0  63.0   NaN
1         2         Akilan  23.0   NaN  56.0  65.0
2         3      Anulaxxmi  23.0   NaN  53.0  33.0
3         4  Aravind Kumar   NaN  65.0   NaN  32.0
4         5          Arjun  34.0  65.0  76.0   NaN
5         6         Ashwin  25.0   NaN  23.0  54.0
6         7           Arya   NaN  57.0  75.0  23.0
7         8           Babu  75.0  54.0   NaN  43.0
8         9  Balaganapathy  43.0   NaN  65.0  43.0
9        10    Balamurugan  54.0  64.0   NaN  75.0
Empty DataFrame
Columns: [Roll no., Name, LICA, DLC, EM 2, T&D]
Index: []

In [69]:
print("\nReplace values:\n\n")
n=pd.read_excel("marksheet.xlsx")
print(n)
y=n.replace({65:39})
print("\n",y)
y.to_excel("marksheet.xlsx")

Replace values:


   Unnamed: 0  Roll no.           Name  LICA  DLC  EM 2   T&D
0           0         1       Abhinith    36   41    63   NaN
1           1         2         Akilan    23   41    56  65.0
2           2         3      Anulaxxmi    23   41    53  33.0
3           3         4  Aravind Kumar    23   65    53  32.0
4           4         5          Arjun    34   65    76  32.0
5           5         6         Ashwin    25   65    23  54.0
6           6         7           Arya    25   57    75  23.0
7           7         8           Babu    75   54    75  43.0
8           8         9  Balaganapathy    43   54    65  43.0
9           9        10    Balamurugan    54   64    65  75.0

    Unnamed: 0  Roll no.           Name  LICA  DLC  EM 2   T&D
0           0         1       Abhinith    36   41    63   NaN
1           1         2         Akilan    23   41    56  39.0
2           2         3      Anulaxxmi    23   41    53  33.0
3           3         4  Aravind Kumar    23   39    53  32.0
4           4         5          Arjun    34   39    76  32.0
5           5         6         Ashwin    25   39    23  54.0
6           6         7           Arya    25   57    75  23.0
7           7         8           Babu    75   54    75  43.0
8           8         9  Balaganapathy    43   54    39  43.0
9           9        10    Balamurugan    54   64    39  75.0

In [75]:
df=pd.read_excel("marksheet.xlsx")
print(df)
print("\n Extract using isin() function:\n")
new=df['LICA'].isin([23])
print(df[new])

   Unnamed: 0.1  Unnamed: 0  Roll no.           Name  LICA  DLC  EM 2   T&D
0             0           0         1       Abhinith    36   41    63   NaN
1             1           1         2         Akilan    23   41    56  39.0
2             2           2         3      Anulaxxmi    23   41    53  33.0
3             3           3         4  Aravind Kumar    23   39    53  32.0
4             4           4         5          Arjun    34   39    76  32.0
5             5           5         6         Ashwin    25   39    23  54.0
6             6           6         7           Arya    25   57    75  23.0
7             7           7         8           Babu    75   54    75  43.0
8             8           8         9  Balaganapathy    43   54    39  43.0
9             9           9        10    Balamurugan    54   64    39  75.0

 Extract using isin() function:

   Unnamed: 0.1  Unnamed: 0  Roll no.           Name  LICA  DLC  EM 2   T&D
1             1           1         2         Akilan    23   41    56  39.0
2             2           2         3      Anulaxxmi    23   41    53  33.0
3             3           3         4  Aravind Kumar    23   39    53  32.0